app/controllers/baskets_controller.rb

SELECT "produits".* FROM "produits" WHERE "produits"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
INSERT INTO "commandes" ("total_price", "status", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["total_price", 0.0], ["status", false], ["created_at", "2024-03-26 08:14:04.778498"], ["updated_at", "2024-03-26 08:14:04.778498"], ["user_id", 57]]
SELECT "commandes".* FROM "commandes" WHERE "commandes"."user_id" = $1 AND "commandes"."user_id" = $2 LIMIT $3  [["user_id", 57], ["user_id", 57], ["LIMIT", 1]]
INSERT INTO "baskets" ("produit_id", "commande_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["produit_id", 22], ["commande_id", 1], ["created_at", "2024-03-26 08:14:04.784560"], ["updated_at", "2024-03-26 08:14:04.784560"]]
---
  def create
    @basket = Basket.new
    @produit = Produit.find(params[:produit_id])
    @exploitation = @produit.exploitation
    @basket.produit = @produit
    @commande = current_user.commandes.find_or_create_by(exploitation_id: @exploitation.id)
    @basket.commande = @commande
    if @basket.save