app/controllers/pages_controller.rb

  def home
    @exploitations = Exploitation.all
    @markers = @exploitations.geocoded.map do |exploitation|
---
SELECT "exploitations".* FROM "exploitations" WHERE (exploitations.latitude IS NOT NULL AND exploitations.longitude IS NOT NULL)