app/controllers/produits_controller.rb

  def index
    @exploitation = Exploitation.find(params[:exploitation_id])
    @commande = Commande.find_by(exploitation: @exploitation, user: current_user)
    @produits = @exploitation.produits
    @markers = [{
        lat: @exploitation.latitude,
        lng: @exploitation.longitude,
        info_window_html: render_to_string(partial: "info_window", locals: { exploitation: @exploitation }),
        marker_html: render_to_string(partial: "marker", locals: { exploitation: @exploitation })
      }]
    @basket_counts = {}
    @produits.each do |produit|
---
SELECT "exploitations".* FROM "exploitations" WHERE "exploitations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "exploitations".* FROM "exploitations" WHERE "exploitations"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
SELECT "produits".* FROM "produits" WHERE "produits"."exploitation_id" = $1  [["exploitation_id", 1]]

  def show
    @exploitation = Exploitation.find(params[:exploitation_id])
---
SELECT "exploitations".* FROM "exploitations" WHERE "exploitations"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]

  def new
    @produit = Produit.new
    @exploitation = Exploitation.find(params[:exploitation_id])
---
SELECT "exploitations".* FROM "exploitations" WHERE "exploitations"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]

  def create
    @exploitation = Exploitation.find(params[:exploitation_id])
    @produit = Produit.new(produit_params)
    @produit.exploitation = @exploitation
    if @produit.save
---
SELECT "exploitations".* FROM "exploitations" WHERE "exploitations"."id" = $1 LIMIT $2  [["id", 58], ["LIMIT", 1]]
INSERT INTO "produits" ("name", "category", "price", "quantity", "availability", "exploitation_id", "created_at", "updated_at", "photo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    @produit.destroy
---
DELETE FROM "produits" WHERE "produits"."id" = $1  [["id", 31]]

  def set_produit
    @produit = Produit.find(params[:id])
---
SELECT "produits".* FROM "produits" WHERE "produits"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]