app/controllers/produits_controller.rb

  def update
    if current_user == @exploitation.user
      @produit.update(produit_params)
---
UPDATE "produits" SET "updated_at" = $1 WHERE "produits"."id" = $2  [["updated_at", "2024-03-25 19:39:44.704070"], ["id", 32]]